[M_Ep12_BecomingJack MissionDefinition]
MissionDescription="To stop Jack from awakening the Warrior, you will need to shut down the Guardian Angel. [place]Control Core Angel[-place] is defended by three major obstacles -- two of which you have already planned for. The final obstacle to Angel's lair is a door that will only open for Handsome Jack. Roland's got no idea how to get past this door, unfortunately."
TurnInDescription="With the pocketwatch in hand, Brick's buzzards on your side, and an upgraded Claptrap back in [place]Sanctuary[-place], you are now ready to storm [place]Control Core Angel[-place] and get the Vault Key."

[M_Ep12_BecomingJack:GetWatchSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="To stop Jack from awakening the Warrior, you will need to shut down the Guardian Angel. [place]Control Core Angel[-place] is defended by three major obstacles -- two of which you have already planned for. The final obstacle to Angel's lair is a door that will only open for Handsome Jack. The Angel knows how to bypass this door. She has asked you to kill one of Handsome Jack's body doubles in [place]Opportunity[-place] and steal his pocketwatch. While it still supports all the uses of a regular pocketwatch, like telling time or strangling someone with the chain, it also carries Jack's bio-data. You will need it to bypass the door to [place]Control Core Angel[-place]."

[M_Ep12_BecomingJack:GoToHyperionCitySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="To stop Jack from awakening the Warrior, you will need to shut down the Guardian Angel. [place]Control Core Angel[-place] is defended by three major obstacles -- two of which you have already planned for. The final obstacle to Angel's lair is a door that will only open for Handsome Jack. Angel has asked you to head to the city of [place]Opportunity[-place] and wait for further instructions."

[M_Ep12_BecomingJack:KillDoubleSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="To stop Jack from awakening the Warrior, you will need to shut down the Guardian Angel. [place]Control Core Angel[-place] is defended by three major obstacles -- two of which you have already planned for. The final obstacle to Angel's lair is a door that will only open for Handsome Jack. The Angel knows how to bypass this door. She has asked you to kill one of Handsome Jack's body doubles."

[M_Ep12_BecomingJack:RetrievePasswordSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="To stop Jack from awakening the Warrior, you will need to shut down the Guardian Angel. [place]Control Core Angel[-place] is defended by three major obstacles -- two of which you have already planned for. The final obstacle to Angel's lair is a door that will only open for Handsome Jack. After you collected a pocketwatch device from one of Handsome Jack's doubles, Angel informed you that it isn't all it appears to be. While it still supports all the uses of a regular pocketwatch, like telling time or strangling someone with the chain, it also carries Jack's bio-data. That won't be enough to get through the door, however; even with Jack's bio-data recognized, the door won't open without a password spoken in Jack's voice. Angel has created a voice modulator that will change your natural speaking voice into Handsome Jack's. You need only retrieve it."

[M_Ep12_BecomingJack:UploadSamplesSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="To stop Jack from awakening the Warrior, you will need to shut down the Guardian Angel. [place]Control Core Angel[-place] is defended by three major obstacles -- two of which you have already planned for. The final obstacle to Angel's lair is a door that will only open for Handsome Jack. After you collected a pocketwatch device from one of Handsome Jack's doubles, Angel informed you that it isn't all it appears to be. While it still supports all the uses of a regular pocketwatch, like telling time or strangling someone with the chain, it also carries Jack's bio-data. That won't be enough to get through the door, however; even with Jack's bio-data recognized, the door won't open without a password spoken in Jack's voice. Now that you've collected enough samples of Jack's voice, Angel has asked you to upload the data from the pocketwatch to her, so she can create a voice modulator that will make you sound like Jack."

[M_Ep12_BecomingJack:UseFirstKioskSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="To stop Jack from awakening the Warrior, you will need to shut down the Guardian Angel. [place]Control Core Angel[-place] is defended by three major obstacles -- two of which you have already planned for. The final obstacle to Angel's lair is a door that will only open for Handsome Jack. After you collected a pocketwatch device from one of Handsome Jack's doubles, Angel informed you that it isn't all it appears to be. While it still supports all the uses of a regular pocketwatch, like telling time or strangling someone with the chain, it also carries Jack's bio-data. That won't be enough to get through the door, however; even with Jack's bio-data recognized, the door won't open without a password spoken in Jack's voice. The Angel has asked you to use the pocketwatch to record samples of Jack's voice from the info kiosks scattered around [place]Opportunity[-place]. Once you find enough samples, the Angel will be able to create a voice modulator that will make you sound like Jack."
